import React from 'react'
import My_Navbar from '../navbar/My_Navbar'
import './Blog.css'
import '../../../dist/output.css'
import Footer from '../footer/Footer.jsx'

function Blog() {
  return (
    <>
        <div id="title" class='gird-blog'>
      <header class="page-header-blog absolute top-0 left-0 right-0 bg-black">
         <My_Navbar />
      </header>
      <div class="page-main-blog "> 
        
<div class="flex ">
  <div class="w-1/3 min-h-screen overflow-y-auto">
    <div class="flex space-x-2 bg-slate-50 px-3 py-2">
      
    </div>
    <div class="flex space-x-2 px-3 py-2">
      <img class="w-32 rounded-md" src="https://spaceth.co/wp-content/uploads/2018/05/techly-voyager1-799x423.jpg" alt="test" />
      <h2>ยาน Voyager 2 ของ NASA ขาดการติดต่อกับโลกชั่วคราว</h2>
    </div>
    <div class="flex space-x-2 px-3 py-2">
      <img class="w-32 rounded-md" src="https://scontent.fbkk29-7.fna.fbcdn.net/v/t39.30808-6/383227726_878457133638589_1376710746818769415_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=5f2048&_nc_eui2=AeFdK1XFzCnjFQSoOMBZV8-yR4Vjm9qGw4hHhWOb2obDiND01kdGxvtBIxhd__XschgGqZ-zbkxhsNR-zSgk3e4S&_nc_ohc=45HEthWKjMQAX-xm1RB&_nc_ht=scontent.fbkk29-7.fna&oh=00_AfDJSkVbMdGRP8caFd-q_VUru0Y-exzzIoSz1pCK7myGqQ&oe=6535D28E" alt="test" />
      <h2>เหมืองโมสุมิ : จากพิษร้ายแรงจนถึงการศึกษาจิ๊กซอว์ของเอกภพ</h2>
    </div>
    
  </div>
  <div class="w-1/3 min-h-screen bg-slate-50 px-4 py-5 space-y-3">
    <img src="https://scontent.fbkk29-8.fna.fbcdn.net/v/t39.30808-6/386724006_882613133222989_403082297230926123_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=5f2048&_nc_eui2=AeFDeP_-Ab4SHfxtfYLUuuDYqw_85RXngvurD_zlFeeC-7nC1EGg6yU9zuufSAoDmWUQDSsNGXpIc0ze0wk2xK8s&_nc_ohc=JxVrNRjBKzoAX-VtqZF&_nc_ht=scontent.fbkk29-8.fna&oh=00_AfABkRp0OaQJwyzQ_R4YYaeIPquJfTsNf9dP-LbvD-6o-g&oe=65359FE8" alt="Avocado" />
    <div class="space-y-2">
      <h1 class="text-lg">Information :</h1>
    </div>
    <div>
      <span>
        แม้ว่าเราจะคุ้นภาพของไดโนเสาร์ในสื่อต่าง ๆ แต่เชื่อเถอะว่าสัตว์ดึกดำบรรพ์บางตัวที่ท่านคุ้นหน้าคุ้นตานั้นแท้จริงแล้วมิใช่ไดโนเสาร์! แล้วนักบรรพชีวินวิทยากำหนดนิยามของสัตว์ที่เรียกว่าไดโนเสาร์ไว้อย่างไรกันนะ?
      </span>
    </div>
    <div>
      <span>
        เมื่อราว 250 ล้านปีก่อน หลังจากโลกได้ผ่านการสูญพันธุ์ครั้งที่ใหญ่ที่สุดที่เคยมีมา สัตว์บกที่เคยครอบครองโลกก่อนหน้านี้กว่า 70% ถูกกวาดล้างอย่างสิ้นเชิง เป็นอันจบสิ้นมหายุคแรกที่เรียกว่า พาลีโอโซอิกที่มีมาอย่างยาวนาน โลกได้เข้าสู่มหายุคที่สองที่เรียกว่า มีโซโซอิก (ประกอบด้วย 3 ยุคที่เราคุ้นชื่อกันดีคือ ไทรแอสซิก จูแรสซิก และครีเทเชียส) เมื่อแผ่นดินไร้ผู้ครองบัลลังก์ วิวัฒนาการจึงเริ่มทำหน้าที่ของมันอีกครั้งเพื่อสร้างผู้ปกครองคนใหม่ สัตว์กลุ่มหนึ่งที่มีช่องเปิดช่องเปิดของกระดูกขมับสองช่องได้ถือกำเนิดขึ้นมา สัตว์กลุ่มนี้เรียกว่าอาร์โคซอร์ (Archosaur)
      </span>
    </div>

    <div>
      <span>
        ในเวลาต่อมาอาร์โคซอร์ได้วิวัฒน์จนกลายเป็นสัตว์สองสาย สายแรกคือ ครูโรทาร์ซี (Crurotarsi) หรืออาร์โคซอร์สายจระเข้ กับสายที่สองคือ เอวีเมตาทาร์ซาเลีย (Avemetatarsalia) หรืออาร์โคซอร์สายไดโนเสาร์ และสัตว์เลื้อยคลานบินได้ที่เรียกว่า เทอโรซอร์ จนถึงตอนนี้เราจะเห็นแล้วว่าจระเข้และไดโนเสาร์เป็นญาติกัน
      </span>
    </div>
    <div>
      <span>
        หลักฐานของฟอสซิลบ่งชี้ว่าพวกมันอุบัติขึ้นมาไล่เลี่ยกัน และชิงดีชิงเด่นกันความเป็นใหญ่ในระบบนิเวศของมหายุคมีโซโซอิกมาโดยตลอด แม้ว่าหลังหมดสิ้นมหายุคมีโซโซอิกเมื่ออุกกาบาตพุ่งชนโลกเมื่อ 66 ล้านปีก่อน และเข้าสู่มหายุคที่สามที่เรียกว่า ซีโนโซอิก อันเป็นช่วงเวลาที่สัตว์เลี้ยงลูกด้วยนมกลายเป็นผู้ปกครองโลกแล้ว อาร์โคซอร์ทั้งสองสายก็ยังมีลูกหลานที่ฝ่าวิกฤติการสูญพันธุ์และหลงเหลือรอดมาได้คือเหล่าจระเข้และนกนั่นเอง
      </span>
    </div>
    <div>
      <span>
        กลับมาที่นิยามของสัตว์ที่เรียกว่า ไดโนเสาร์ หลังจากคำว่า Dinosaur ถูกบัญญัติโดยเซอร์ริชาร์ด โอเวน ในปีค.ศ. 1842 นักชีววิทยาและนักบรรพชีวินวิทยาจำนวนมากได้พยายามหาคำจำกัดความของสัตว์ที่เรียกว่าไดโนเสาร์
      </span>
    </div>
    <div>
      <span>
        แน่นอนว่าสัตว์ที่เป็นไดโนเสาร์นั้นต้องเป็นสัตว์ในกลุ่มอาร์โคซอร์เท่านั้น ด้วยเหตุนี้ สัตว์เลื้อยคลานกลุ่มอื่น ๆ ไม่ว่าจะเป็นเต่า กิ้งก่าและงู สัตว์เลื้อยคลานทะเลชนิดต่าง ๆ เช่นพลีซิโอซอร์ (นึกถึงพีซุเกะ จากโดราเอม่อนเดอะมูฟวี่ ตอนไดโนเสาร์ของโนบิตะ) หรือเหล่าซีแนปซิด (synapsid) อันเป็นกลุ่มของสัตว์ที่ดูคล้ายสัตว์เลื้อยคลานที่มีช่องเปิดกระดูกขมับใต้เพดานกะโหลกหนึ่งช่อง เช่น ไดเมโทรดอน (Dimetrodon) ที่มีกระโดงอยู่บนหลัง แม้จะดูคล้ายสัตว์เลื้อยคลาน แต่ซีแนปซิดกลับมีความใกล้ชิดกับสัตว์เลี้ยงลูกด้วยน้ำนมมากกว่า ด้วยเหตุนี้ สัตว์พวกนี้จึงตกจากนิยามของไดโนเสาร์ไปทั้งสิ้น
      </span>
    </div>
    <div>
      <span>
        มาพิจารณาในหมู่มวลอาร์โคซอร์ด้วยกัน ขาหลังของไดโนเสาร์เชื่อมต่อกับเบ้าของสะโพกในลักษณะตั้งตรง เหมือนกับสัตว์เลี้ยงลูกด้วยน้ำนม นับเป็นหนึ่งในความโดดเด่นด้านวิวัฒนาการ ทำให้พวกมันประสบความสำเร็จเหนือกว่าสัตว์เลื้อยคลานอื่น ๆ ในช่วงเวลาเดียวกัน เมื่อเรามองจากมุมด้านบน ขาของไดโนเสาร์จะไม่กางออกข้างลำตัวแบบสัตว์เลื้อยคลานกลุ่มอื่น มันจึงเคลื่อนไหวได้รวดเร็วและคล่องตัวกว่า อีกทั้งยังเพิ่มสมรรถนะในการรองรับน้ำหนักได้ดีกว่าด้วย (ดังนั้น อาร์โคซอร์สายจระเข้ก็ไม่ใช่ไดโนเสาร์)
      </span>
    </div>
    <div>
      <span>
        อย่างไรก็ตาม คุณลักษณะนี้นับเป็นลักษณะเฉพาะของสัตว์กลุ่มไดโนเสาร์ แต่ใดๆ ในชีววิทยาล้วนมีข้อยกเว้น เพราะอาร์โคซอร์สายจระเข้บางชนิดก็ได้วิวัฒน์มีขาเหยียดตรงใต้ลำตัวเหมือนไดโนเสาร์เช่นกัน อีกหนึ่งลักษณะที่ช่วยในการนิยามไดโนเสาร์ได้ดีคือกระดูกสองชิ้นบริเวณข้อเท้า ประกอบด้วย กระดูกตาตุ่ม (astragalus) และกระดูกส้นเท้า (calcaneum) ในอาร์โคซอร์สายจระเข้นั้น กระดูกทั้งสองจะมีขนาดใกล้เคียงกันทำให้ไม่ค่อยมีความยืดหยุ่นเท่าที่ควรระหว่างเคลื่อนไหว ในขณะที่ไดโนเสาร์จะมีกระดูกตาตุ่มที่ใหญ่กว่ากระดูกส้นเท้า กระดูกข้อเท้าทั้งสองชิ้นเชื่อมต่อกัน รวมถึงเชื่อมกับกระดูกหน้าแข้งและกระดูกน่องอย่างแนบแน่น ทำให้เกิดระนาบของข้อพับ ส่งผลให้ข้อเท้าบิดไปข้างหน้าและข้างหลังได้อย่างเต็มที่ซึ่งช่วยสนับสนุนการยืนตัวตรง และการเพิ่มความเร็วขณะดินหรือวิ่งได้อย่างมีประสิทธิภาพ และนี่คือกุญแจความสำเร็จของอาร์โคซอร์สายไดโนเสาร์ และยังเป็นปรากฏมาจนถึงนกในปัจจุบันอีกด้วย
      </span>
    </div>
    <div>
      <span>
        นอกจากนี้ยังมีลักษณะทางกายวิภาคศาสตร์อื่น ๆ ที่ช่วยให้การนิยายสัตว์ที่เรียกว่าไดโนเสาร์ชัดเจนขึ้น แต่เราอาจจะต้องใช้เวลาในการเล่าที่นานกว่านี้ รวมถึงมีศัพท์เฉพาะอีกมหาศาลที่จะปรากฏออกมาแต่อย่างน้อยก็หวังว่าเมื่อคุณอ่านมาถึงตรงนี้ จะช่วยให้คุณแยกเหล่าสัตว์ดึกดำบรรพ์ได้ถูกต้องมากขึ้นว่าตัวใดใช่หรือไม่ใช่ไดโนเสาร์
      </span>
    </div>
    <div>
        <span>อ้างอิง
Brusatte, S.L. Dinosaur Paleobiology. Wiley-Blackwell. 2012. 352 pp. doi: 10.1002/9781118274071 <br />
<a href="https://www.nhm.ac.uk/discover/what-are-dinosaurs.html">https://www.nhm.ac.uk/discover/what-are-dinosaurs.html</a></span>
    </div>
  </div>
</div>
        
      </div>
      <footer class="page-footer-blog bg-black">
        <Footer />
      </footer> 
    </div>
    </>
  )
}

export default Blog